EKS/JMeter/report/statistics.json
{
  "03 - Socket.io Polling" : {
    "transaction" : "03 - Socket.io Polling",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 210.34000000000003,
    "medianResTime" : 210.0,
    "minResTime" : 205.0,
    "maxResTime" : 220.0,
    "pct1ResTime" : 216.9,
    "pct2ResTime" : 218.45,
    "pct3ResTime" : 220.0,
    "throughput" : 1.6703972204590252,
    "receivedKBytesPerSec" : 0.5040554112517956,
    "sentKBytesPerSec" : 0.26589330755353624
  },
  "01 - Load Homepage" : {
    "transaction" : "01 - Load Homepage",
    "sampleCount" : 213,
    "errorCount" : 24,
    "errorPct" : 11.267606,
    "meanResTime" : 408.4037558685447,
    "medianResTime" : 240.0,
    "minResTime" : 0.0,
    "maxResTime" : 5009.0,
    "pct1ResTime" : 448.0,
    "pct2ResTime" : 480.59999999999997,
    "pct3ResTime" : 4616.499999999996,
    "throughput" : 1.9095432336725089,
    "receivedKBytesPerSec" : 10.333536212963377,
    "sentKBytesPerSec" : 0.21345260040790712
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 313,
    "errorCount" : 74,
    "errorPct" : 23.642172,
    "meanResTime" : 345.5143769968052,
    "medianResTime" : 227.0,
    "minResTime" : 0.0,
    "maxResTime" : 5009.0,
    "pct1ResTime" : 442.6,
    "pct2ResTime" : 454.6,
    "pct3ResTime" : 4365.180000000006,
    "throughput" : 2.806042404410776,
    "receivedKBytesPerSec" : 10.60406184163342,
    "sentKBytesPerSec" : 0.3443379773858084
  },
  "02 - Backend Health Check" : {
    "transaction" : "02 - Backend Health Check",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 212.77999999999992,
    "medianResTime" : 210.0,
    "minResTime" : 205.0,
    "maxResTime" : 258.0,
    "pct1ResTime" : 218.0,
    "pct2ResTime" : 242.7999999999999,
    "pct3ResTime" : 258.0,
    "throughput" : 1.6528925619834711,
    "receivedKBytesPerSec" : 0.4987732438016529,
    "sentKBytesPerSec" : 0.21952479338842976
  }
}